[Killed] BlockStatement
src/controllers/saleControl.js:5:48
 
 const saleServ = require('../services/saleService');
 
-const saleList = async (_request, response) => {
-    const sale = await saleServ.saleList();
-
-    return response.status(200).json(sale);
-};
+const saleList = async (_request, response) => {};
 
 const saleListById = async (request, response) => {
killedBy: teste de control da rota /sales teste da res de /sales
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/saleControl.js:11:51
     return response.status(200).json(sale);
 };
 
-const saleListById = async (request, response) => {
-    const { id } = request.params;
-    const sale = await saleServ.saleListById(id);
-    if (sale.message) return response.status(404).json(sale);
-    return response.status(200).json(sale);
-};
+const saleListById = async (request, response) => {};
 
 const addSale = async (request, response) => {
killedBy: teste de control da rota /sales teste da res de /sales/:id
statusReason: expected stub to have been called with arguments 200

[Killed] ConditionalExpression
src/controllers/saleControl.js:14:9
 const saleListById = async (request, response) => {
     const { id } = request.params;
     const sale = await saleServ.saleListById(id);
-    if (sale.message) return response.status(404).json(sale);
+    if (false) return response.status(404).json(sale);
     return response.status(200).json(sale);
 };
killedBy: teste de control da rota /sales teste da res de /sales/:id
statusReason: Attempted to wrap saleListById which is already wrapped

[Killed] ConditionalExpression
src/controllers/saleControl.js:14:9
 const saleListById = async (request, response) => {
     const { id } = request.params;
     const sale = await saleServ.saleListById(id);
-    if (sale.message) return response.status(404).json(sale);
+    if (true) return response.status(404).json(sale);
     return response.status(200).json(sale);
 };
killedBy: teste de control da rota /sales teste da res de /sales/:id
statusReason: Attempted to wrap saleListById which is already wrapped

[NoCoverage] BlockStatement
src/controllers/saleControl.js:18:46
     return response.status(200).json(sale);
 };
 
-const addSale = async (request, response) => {
-    const sale = request.body;
-    const freshSale = await saleServ.addSale(sale);
-    if (freshSale.message === 'Product not found') return response.status(404).json(freshSale);
-    return response.status(201).json(freshSale);
-};
+const addSale = async (request, response) => {};
 
 module.exports = {

[NoCoverage] ConditionalExpression
src/controllers/saleControl.js:21:9
 const addSale = async (request, response) => {
     const sale = request.body;
     const freshSale = await saleServ.addSale(sale);
-    if (freshSale.message === 'Product not found') return response.status(404).json(freshSale);
+    if (true) return response.status(404).json(freshSale);
     return response.status(201).json(freshSale);
 };

[NoCoverage] ConditionalExpression
src/controllers/saleControl.js:21:9
 const addSale = async (request, response) => {
     const sale = request.body;
     const freshSale = await saleServ.addSale(sale);
-    if (freshSale.message === 'Product not found') return response.status(404).json(freshSale);
+    if (false) return response.status(404).json(freshSale);
     return response.status(201).json(freshSale);
 };
