[NoCoverage] BlockStatement
src/middlewares/saleBodyValid.js:3:58
 // validacao de se há o id e quantidade de produtos na venda
 
-const saleBodyValid = async (request, response, next) => {
-    if (!request.body[0].quantity && request.body[0].quantity !== 0) {
-        return response.status(400).json({ message: '"quantity" is required' });
-    }
-    if (!request.body[0].productId) {
-        return response.status(400).json({ message: '"productId" is required' });
-    }
-    next();
-};
+const saleBodyValid = async (request, response, next) => {};
 
 module.exports = saleBodyValid;

[NoCoverage] ConditionalExpression
src/middlewares/saleBodyValid.js:4:9
 // validacao de se há o id e quantidade de produtos na venda
 
 const saleBodyValid = async (request, response, next) => {
-    if (!request.body[0].quantity && request.body[0].quantity !== 0) {
+    if (false) {
         return response.status(400).json({ message: '"quantity" is required' });
     }

[NoCoverage] BlockStatement
src/middlewares/saleBodyValid.js:4:70
 // validacao de se há o id e quantidade de produtos na venda
 
 const saleBodyValid = async (request, response, next) => {
-    if (!request.body[0].quantity && request.body[0].quantity !== 0) {
-        return response.status(400).json({ message: '"quantity" is required' });
-    }
+    if (!request.body[0].quantity && request.body[0].quantity !== 0) {}
     if (!request.body[0].productId) {
         return response.status(400).json({ message: '"productId" is required' });

[NoCoverage] ConditionalExpression
src/middlewares/saleBodyValid.js:7:9
     if (!request.body[0].quantity && request.body[0].quantity !== 0) {
         return response.status(400).json({ message: '"quantity" is required' });
     }
-    if (!request.body[0].productId) {
+    if (false) {
         return response.status(400).json({ message: '"productId" is required' });
     }

[NoCoverage] BooleanLiteral
src/middlewares/saleBodyValid.js:7:9
     if (!request.body[0].quantity && request.body[0].quantity !== 0) {
         return response.status(400).json({ message: '"quantity" is required' });
     }
-    if (!request.body[0].productId) {
+    if (request.body[0].productId) {
         return response.status(400).json({ message: '"productId" is required' });
     }
