[NoCoverage] BlockStatement
src/middlewares/saleValid.js:5:59
 
 const { saleForm } = require('./joiSchema');
 
-const saleValidating = async (request, response, next) => {
-  try {
-    const err = request.body
-      .map((i) => saleForm.validate(i).error)
-      .filter((error) => error);
-
-    if (err.some((error) => error.message.includes('be greater than'))) {
-      throw new Error(err.find((error) => error.message.includes('be greater than')).message);
-    }
-
-    if (err.some((error) => error.message.includes('is required'))) {
-      throw new Error(err.find((error) => error.message.includes('is required')).message);
-    }
-
-    next();
-  } catch (error) {
-    return response.status(422).json({ message: error.message });
-  }
-};
+const saleValidating = async (request, response, next) => {};
 
 module.exports = saleValidating;

[NoCoverage] BlockStatement
src/middlewares/saleValid.js:6:7
 const { saleForm } = require('./joiSchema');
 
 const saleValidating = async (request, response, next) => {
-  try {
-    const err = request.body
-      .map((i) => saleForm.validate(i).error)
-      .filter((error) => error);
-
-    if (err.some((error) => error.message.includes('be greater than'))) {
-      throw new Error(err.find((error) => error.message.includes('be greater than')).message);
-    }
-
-    if (err.some((error) => error.message.includes('is required'))) {
-      throw new Error(err.find((error) => error.message.includes('is required')).message);
-    }
-
-    next();
-  } catch (error) {
+  try {} catch (error) {
     return response.status(422).json({ message: error.message });
   }

[NoCoverage] MethodExpression
src/middlewares/saleValid.js:7:17
 
 const saleValidating = async (request, response, next) => {
   try {
-    const err = request.body
-      .map((i) => saleForm.validate(i).error)
-      .filter((error) => error);
+    const err = request.body.map(i => saleForm.validate(i).error);
 
     if (err.some((error) => error.message.includes('be greater than'))) {

[NoCoverage] BlockStatement
src/middlewares/saleValid.js:11:73
       .map((i) => saleForm.validate(i).error)
       .filter((error) => error);
 
-    if (err.some((error) => error.message.includes('be greater than'))) {
-      throw new Error(err.find((error) => error.message.includes('be greater than')).message);
-    }
+    if (err.some((error) => error.message.includes('be greater than'))) {}
 
     if (err.some((error) => error.message.includes('is required'))) {

[NoCoverage] MethodExpression
src/middlewares/saleValid.js:11:9
       .map((i) => saleForm.validate(i).error)
       .filter((error) => error);
 
-    if (err.some((error) => error.message.includes('be greater than'))) {
+    if (err.every(error => error.message.includes('be greater than'))) {
       throw new Error(err.find((error) => error.message.includes('be greater than')).message);
     }

[NoCoverage] ConditionalExpression
src/middlewares/saleValid.js:15:9
       throw new Error(err.find((error) => error.message.includes('be greater than')).message);
     }
 
-    if (err.some((error) => error.message.includes('is required'))) {
+    if (true) {
       throw new Error(err.find((error) => error.message.includes('is required')).message);
     }

[NoCoverage] MethodExpression
src/middlewares/saleValid.js:15:9
       throw new Error(err.find((error) => error.message.includes('be greater than')).message);
     }
 
-    if (err.some((error) => error.message.includes('is required'))) {
+    if (err.every(error => error.message.includes('is required'))) {
       throw new Error(err.find((error) => error.message.includes('is required')).message);
     }

[NoCoverage] BlockStatement
src/middlewares/saleValid.js:20:19
     }
 
     next();
-  } catch (error) {
-    return response.status(422).json({ message: error.message });
-  }
+  } catch (error) {}
 };
 
