[Killed] BlockStatement
src/models/prodModel.js:6:30
 const connect = require('./connection');
 
 // Retorna lista de produtos da tabela mysql
-const prodList = async () => {
-    const [prod] = await connect.execute('SELECT * FROM products');
-    return prod;
-};
+const prodList = async () => {};
 
 // Captura produto segundo param de Id em comandos no mysql
killedBy: teste rota de prod em Model teste de called da rota de prod
statusReason: expected undefined to deeply equal [ Array(3) ]

[Killed] BlockStatement
src/models/prodModel.js:12:36
 };
 
 // Captura produto segundo param de Id em comandos no mysql
-const prodListById = async (id) => {
-    const [[prod]] = await connect.execute('SELECT * FROM products WHERE id = ?', [id]);
-    return prod;
-};
+const prodListById = async (id) => {};
 
 // adicionando produto no BD
killedBy: teste rota de prod em Model teste se a rota com Id param é chamada
statusReason: Attempted to wrap execute which is already wrapped

[Killed] BlockStatement
src/models/prodModel.js:18:33
 };
 
 // adicionando produto no BD
-const addProd = async (name) => {
-    const [{ insertId }] = await connect.execute(
-        'INSERT INTO products (name) VALUES (?)',
-        [name],
-    );
-    return {
-        id: insertId,
-        name,
-    };
-};
+const addProd = async (name) => {};
 
 const verifyProd = async (id) => {
killedBy: teste rota de prod em Model teste se rota de criacao e corretamente chamada
statusReason: Attempted to wrap execute which is already wrapped

[NoCoverage] BlockStatement
src/models/prodModel.js:29:34
     };
 };
 
-const verifyProd = async (id) => {
-    const [prod] = await connect.execute(
-        'SELECT * FROM products WHERE id = ?',
-        [id],
-    );
-    return prod.length > 0;
-};
+const verifyProd = async (id) => {};
 
 const editProd = async (id, name) => {

[NoCoverage] EqualityOperator
src/models/prodModel.js:34:12
         'SELECT * FROM products WHERE id = ?',
         [id],
     );
-    return prod.length > 0;
+    return prod.length >= 0;
 };
 

[NoCoverage] ConditionalExpression
src/models/prodModel.js:34:12
         'SELECT * FROM products WHERE id = ?',
         [id],
     );
-    return prod.length > 0;
+    return true;
 };
 

[NoCoverage] BlockStatement
src/models/prodModel.js:37:38
     return prod.length > 0;
 };
 
-const editProd = async (id, name) => {
-    if (await verifyProd(id)) {
-        await connect.execute(
-            'UPDATE products SET name = ? WHERE id = ?',
-            [name, id],
-        );
-        return {
-            id: Number(id),
-            name,
-        };
-    }
-    return { message: 'Product not found' };
-};
+const editProd = async (id, name) => {};
 
 module.exports = {

[NoCoverage] ConditionalExpression
src/models/prodModel.js:38:9
 };
 
 const editProd = async (id, name) => {
-    if (await verifyProd(id)) {
+    if (true) {
         await connect.execute(
             'UPDATE products SET name = ? WHERE id = ?',

[NoCoverage] ConditionalExpression
src/models/prodModel.js:38:9
 };
 
 const editProd = async (id, name) => {
-    if (await verifyProd(id)) {
+    if (false) {
         await connect.execute(
             'UPDATE products SET name = ? WHERE id = ?',
