[Killed] BlockStatement
src/models/saleModel.js:5:30
 
 const connect = require('./connection');
 
-const saleList = async () => {
-    const allQueryList = `
-    SELECT
-  sp.sale_id AS saleId,
-  s.date,
-  sp.product_id AS productId,
-  sp.quantity
-FROM
-  sales_products sp
-  INNER JOIN sales s ON sp.sale_id = s.id
-ORDER BY
-  sp.sale_id ASC,
-  sp.product_id ASC
-  `;
-    const [sale] = await connect.execute(allQueryList);
-    return sale;
-};
+const saleList = async () => {};
 
 const queryId = `
killedBy: teste da rota sales em Model teste se a rota de /sales é corretamente chamada
statusReason: Attempted to wrap execute which is already wrapped

[Killed] BlockStatement
src/models/saleModel.js:37:36
   sp.sale_id ASC,
   sp.product_id ASC
 `;
-const saleListById = async (id) => {
-        const [sale] = await connect.execute(queryId, [id]);
-        return sale;
-};
+const saleListById = async (id) => {};
 
 // 
killedBy: teste da rota sales em Model teste se /sales/:id é corretamente chamada
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/models/saleModel.js:43:42
 };
 
 // 
-const verifyProdIdSale = async (sale) => {
-  const command = 'SELECT id FROM products WHERE id = ?';
-  const arrMap = sale.map(async (i) => {
-    const [product] = await connect.execute(command, [i.productId]);
-    return product.length === 0;
-  });
-  const resposta = await Promise.all(arrMap);
-  return resposta.every((i) => i === false);
-};
+const verifyProdIdSale = async (sale) => {};
 
 const insertSale = async (sale, insertId) => sale.map(async (elem) => {
killedBy: teste da rota sales em Model teste darota sale na post function com prod que nao existe
statusReason: expected undefined to deeply equal false

[Survived] BlockStatement
src/models/saleModel.js:45:40
 // 
 const verifyProdIdSale = async (sale) => {
   const command = 'SELECT id FROM products WHERE id = ?';
-  const arrMap = sale.map(async (i) => {
-    const [product] = await connect.execute(command, [i.productId]);
-    return product.length === 0;
-  });
+  const arrMap = sale.map(async (i) => {});
   const resposta = await Promise.all(arrMap);
   return resposta.every((i) => i === false);

[Killed] ConditionalExpression
src/models/saleModel.js:47:12
   const command = 'SELECT id FROM products WHERE id = ?';
   const arrMap = sale.map(async (i) => {
     const [product] = await connect.execute(command, [i.productId]);
-    return product.length === 0;
+    return false;
   });
   const resposta = await Promise.all(arrMap);
killedBy: teste da rota sales em Model teste darota sale na post function com prod que nao existe
statusReason: expected true to deeply equal false

[Killed] EqualityOperator
src/models/saleModel.js:47:12
   const command = 'SELECT id FROM products WHERE id = ?';
   const arrMap = sale.map(async (i) => {
     const [product] = await connect.execute(command, [i.productId]);
-    return product.length === 0;
+    return product.length !== 0;
   });
   const resposta = await Promise.all(arrMap);
killedBy: teste da rota sales em Model teste darota sale na post function com prod que nao existe
statusReason: expected true to deeply equal false

[Killed] EqualityOperator
src/models/saleModel.js:50:32
     return product.length === 0;
   });
   const resposta = await Promise.all(arrMap);
-  return resposta.every((i) => i === false);
+  return resposta.every((i) => i !== false);
 };
 
killedBy: teste da rota sales em Model teste darota sale na post function com prod que nao existe
statusReason: expected true to deeply equal false

[Killed] ConditionalExpression
src/models/saleModel.js:50:32
     return product.length === 0;
   });
   const resposta = await Promise.all(arrMap);
-  return resposta.every((i) => i === false);
+  return resposta.every((i) => true);
 };
 
killedBy: teste da rota sales em Model teste darota sale na post function com prod que nao existe
statusReason: expected true to deeply equal false

[NoCoverage] BlockStatement
src/models/saleModel.js:53:71
   return resposta.every((i) => i === false);
 };
 
-const insertSale = async (sale, insertId) => sale.map(async (elem) => {
-    const { productId, quantity } = elem;
-    await connect
-    .execute(
-'INSERT INTO sales_products (sale_id, product_id, quantity) VALUES (?, ?, ?)', 
-    [insertId, productId, quantity],
-);
-    return { productId, quantity };
-  });
+const insertSale = async (sale, insertId) => sale.map(async (elem) => {});
 
 const addSaleToBD = async (sale) => {

[NoCoverage] BlockStatement
src/models/saleModel.js:63:37
     return { productId, quantity };
   });
 
-const addSaleToBD = async (sale) => {
-  const now = new Date().toISOString().slice(0, 19).replace('T', ' ');
-  const [{ insertId }] = await connect
-  .execute('INSERT INTO sales (date) VALUES (?)', [now]);
-  const allInsertSale = await insertSale(sale, insertId);
-  const itemsSold = await Promise.all(allInsertSale);
-  return { id: insertId, itemsSold };
-};
+const addSaleToBD = async (sale) => {};
 
 const addSale = async (sale) => {

[NoCoverage] MethodExpression
src/models/saleModel.js:64:15
   });
 
 const addSaleToBD = async (sale) => {
-  const now = new Date().toISOString().slice(0, 19).replace('T', ' ');
+  const now = new Date().toISOString().replace('T', ' ');
   const [{ insertId }] = await connect
   .execute('INSERT INTO sales (date) VALUES (?)', [now]);

[NoCoverage] BlockStatement
src/models/saleModel.js:72:33
   return { id: insertId, itemsSold };
 };
 
-const addSale = async (sale) => {
-  if (await verifyProdIdSale(sale)) {
-    return addSaleToBD(sale);
-  }
-    return { message: 'Product not found' };
-};
+const addSale = async (sale) => {};
 
 module.exports = {

[NoCoverage] BlockStatement
src/models/saleModel.js:73:37
 };
 
 const addSale = async (sale) => {
-  if (await verifyProdIdSale(sale)) {
-    return addSaleToBD(sale);
-  }
+  if (await verifyProdIdSale(sale)) {}
     return { message: 'Product not found' };
 };

[NoCoverage] ConditionalExpression
src/models/saleModel.js:73:7
 };
 
 const addSale = async (sale) => {
-  if (await verifyProdIdSale(sale)) {
+  if (false) {
     return addSaleToBD(sale);
   }
