[Killed] BlockStatement
src/controllers/prodControl.js:5:48
 
 const prodServ = require('../services/prodService');
 
-const prodList = async (_request, response) => {
-    const prod = await prodServ.prodList();
-
-    return response.status(200).json(prod);
-};
+const prodList = async (_request, response) => {};
 
 const prodListById = async (request, response) => {
killedBy: teste de controller da rota /products teste da res da rota /products
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/prodControl.js:11:51
     return response.status(200).json(prod);
 };
 
-const prodListById = async (request, response) => {
-    const { id } = request.params;
-
-    const prod = await prodServ.prodListById(id);
-    if (prod.message) return response.status(404).json(prod);
-    return response.status(200).json(prod);
-};
+const prodListById = async (request, response) => {};
 
 const addProd = async (request, response) => {
killedBy: teste de controller da rota /products teste da res da rota /products/:id
statusReason: expected stub to have been called with arguments 200

[Killed] ConditionalExpression
src/controllers/prodControl.js:15:9
     const { id } = request.params;
 
     const prod = await prodServ.prodListById(id);
-    if (prod.message) return response.status(404).json(prod);
+    if (true) return response.status(404).json(prod);
     return response.status(200).json(prod);
 };
killedBy: teste de controller da rota /products teste da res da rota /products/:id
statusReason: Attempted to wrap prodListById which is already wrapped

[Killed] ConditionalExpression
src/controllers/prodControl.js:15:9
     const { id } = request.params;
 
     const prod = await prodServ.prodListById(id);
-    if (prod.message) return response.status(404).json(prod);
+    if (false) return response.status(404).json(prod);
     return response.status(200).json(prod);
 };
killedBy: teste de controller da rota /products teste da res da rota /products/:id
statusReason: Attempted to wrap prodListById which is already wrapped

[Killed] BlockStatement
src/controllers/prodControl.js:19:46
     return response.status(200).json(prod);
 };
 
-const addProd = async (request, response) => {
-    const { name } = request.body;
-    const prod = await prodServ.addProd(name);
-    return response.status(201).json(prod);
-};
+const addProd = async (request, response) => {};
 
 const editProd = async (request, response) => {
killedBy: teste de controller da rota /products teste se a res de /products retorna corretamente com item
statusReason: expected stub to have been called with arguments 201

[Killed] BlockStatement
src/controllers/prodControl.js:25:47
     return response.status(201).json(prod);
 };
 
-const editProd = async (request, response) => {
-    const { id } = request.params;
-    const { name } = request.body;
-    const prod = await prodServ.editProd(id, name);
-    if (prod.message === 'Product not found') return response.status(404).json(prod);
-    return response.status(200).json(prod);
-};
+const editProd = async (request, response) => {};
 
 module.exports = {
killedBy: teste de controller da rota /products teste da rota put /products/:id
statusReason: expected stub to have been called with arguments 200

[Killed] ConditionalExpression
src/controllers/prodControl.js:29:9
     const { id } = request.params;
     const { name } = request.body;
     const prod = await prodServ.editProd(id, name);
-    if (prod.message === 'Product not found') return response.status(404).json(prod);
+    if (true) return response.status(404).json(prod);
     return response.status(200).json(prod);
 };
killedBy: teste de controller da rota /products teste da rota put /products/:id
statusReason: Attempted to wrap editProd which is already wrapped

[Killed] EqualityOperator
src/controllers/prodControl.js:29:9
     const { id } = request.params;
     const { name } = request.body;
     const prod = await prodServ.editProd(id, name);
-    if (prod.message === 'Product not found') return response.status(404).json(prod);
+    if (prod.message !== 'Product not found') return response.status(404).json(prod);
     return response.status(200).json(prod);
 };
killedBy: teste de controller da rota /products teste da rota put /products/:id
statusReason: Attempted to wrap editProd which is already wrapped
