[Killed] BlockStatement
src/middlewares/bodyValid.js:3:54
 // validation de nome requerido
 
-const bodyValid = async (request, response, next) => {
-    if (request.body.name === undefined) {
-        return response.status(400).json({ message: '"name" is required' });
-    }
-    next(); 
-};
+const bodyValid = async (request, response, next) => {};
 
 module.exports = bodyValid;
killedBy: teste retorno de bodyValid teste de retorno de valid body
statusReason: expected stub to have been called with arguments

[Killed] ConditionalExpression
src/middlewares/bodyValid.js:4:9
 // validation de nome requerido
 
 const bodyValid = async (request, response, next) => {
-    if (request.body.name === undefined) {
+    if (true) {
         return response.status(400).json({ message: '"name" is required' });
     }
killedBy: teste retorno de bodyValid teste de retorno de valid body
statusReason: expected stub to have been called with arguments

[Killed] ConditionalExpression
src/middlewares/bodyValid.js:4:9
 // validation de nome requerido
 
 const bodyValid = async (request, response, next) => {
-    if (request.body.name === undefined) {
+    if (false) {
         return response.status(400).json({ message: '"name" is required' });
     }
killedBy: teste retorno de bodyValid teste retorno de invalid body
statusReason: expected stub to have been called with arguments 400
