[Killed] BlockStatement
src/middlewares/idValid.js:5:52
 
 const { idForm } = require('./joiSchema');
 
-const idValid = async (request, response, next) => {
-    const { error } = idForm.validate(request.params);
-
-    if (error) return response.status(422).json({ message: 'The data is not in the right form' });
-    next();
-};
+const idValid = async (request, response, next) => {};
 
 module.exports = idValid;
killedBy: teste do retorno do middlew idValid teste de retorno de valid id
statusReason: expected stub to have been called with arguments

[Killed] ConditionalExpression
src/middlewares/idValid.js:8:9
 const idValid = async (request, response, next) => {
     const { error } = idForm.validate(request.params);
 
-    if (error) return response.status(422).json({ message: 'The data is not in the right form' });
+    if (true) return response.status(422).json({ message: 'The data is not in the right form' });
     next();
 };
killedBy: teste do retorno do middlew idValid teste de retorno de valid id
statusReason: expected stub to have been called with arguments

[Killed] ConditionalExpression
src/middlewares/idValid.js:8:9
 const idValid = async (request, response, next) => {
     const { error } = idForm.validate(request.params);
 
-    if (error) return response.status(422).json({ message: 'The data is not in the right form' });
+    if (false) return response.status(422).json({ message: 'The data is not in the right form' });
     next();
 };
killedBy: teste do retorno do middlew idValid teste de retorno de invalid id
statusReason: expected stub to have been called with arguments 422
