[Killed] BlockStatement
src/middlewares/prodNameValid.js:5:58
 
 const { prodNameForm } = require('./joiSchema');
 
-const prodNameValid = async (request, response, next) => {
-    const { error } = prodNameForm.validate(request.body);
-    if (error && error.message === '"name" is not allowed to be empty') {
- return response.status(400).json(
-        { message: error.message },
-        ); 
-    }
-    if (error && error.message === '"name" length must be at least 5 characters long') {
-    return response.status(422).json(
-            { message: error.message },
-            );
-    }
-    next();
-};
+const prodNameValid = async (request, response, next) => {};
 
 module.exports = prodNameValid;
killedBy: teste de return de nameValid teste valid name
statusReason: expected stub to have been called with arguments

[Killed] BlockStatement
src/middlewares/prodNameValid.js:7:73
 
 const prodNameValid = async (request, response, next) => {
     const { error } = prodNameForm.validate(request.body);
-    if (error && error.message === '"name" is not allowed to be empty') {
- return response.status(400).json(
-        { message: error.message },
-        ); 
-    }
+    if (error && error.message === '"name" is not allowed to be empty') {}
     if (error && error.message === '"name" length must be at least 5 characters long') {
     return response.status(422).json(
killedBy: teste de return de nameValid teste se ha retorno com empty name
statusReason: expected stub to have been called with arguments 400

[Killed] ConditionalExpression
src/middlewares/prodNameValid.js:7:9
 
 const prodNameValid = async (request, response, next) => {
     const { error } = prodNameForm.validate(request.body);
-    if (error && error.message === '"name" is not allowed to be empty') {
+    if (false) {
  return response.status(400).json(
         { message: error.message },
killedBy: teste de return de nameValid teste se ha retorno com empty name
statusReason: expected stub to have been called with arguments 400

[Killed] EqualityOperator
src/middlewares/prodNameValid.js:12:18
         { message: error.message },
         ); 
     }
-    if (error && error.message === '"name" length must be at least 5 characters long') {
+    if (error && error.message !== '"name" length must be at least 5 characters long') {
     return response.status(422).json(
             { message: error.message },
killedBy: teste de return de nameValid teste se nome com menos de 5 caract
statusReason: expected stub to have been called with arguments 422

[Killed] LogicalOperator
src/middlewares/prodNameValid.js:12:9
         { message: error.message },
         ); 
     }
-    if (error && error.message === '"name" length must be at least 5 characters long') {
+    if (error || error.message === '"name" length must be at least 5 characters long') {
     return response.status(422).json(
             { message: error.message },
killedBy: teste de return de nameValid teste valid name
statusReason: Cannot read properties of undefined (reading 'message')
