[Killed] BlockStatement
src/services/prodService.js:6:30
 const prodModel = require('../models/prodModel');
 
 // Recebe dados da camada model com a lista de produtos
-const prodList = async () => {
-    const prod = await prodModel.prodList();
-    return prod;
-};
+const prodList = async () => {};
 
 // Procura produto por Id e se não encontrar dá product not found
killedBy: teste de describe de /products teste da res da rota /products
statusReason: expected undefined to deeply equal [ Array(3) ]

[Killed] BlockStatement
src/services/prodService.js:12:36
 };
 
 // Procura produto por Id e se não encontrar dá product not found
-const prodListById = async (id) => {
-    const prod = await prodModel.prodListById(id);
-    if (!prod) return { message: 'Product not found' };
-    return prod;
-};
+const prodListById = async (id) => {};
 
 const addProd = async (name) => {
killedBy: teste de describe de /products teste da res da rota /products/:id
statusReason: expected undefined to deeply equal { id: 1, name: 'Martelo de Thor' }

[Killed] ConditionalExpression
src/services/prodService.js:14:9
 // Procura produto por Id e se não encontrar dá product not found
 const prodListById = async (id) => {
     const prod = await prodModel.prodListById(id);
-    if (!prod) return { message: 'Product not found' };
+    if (false) return { message: 'Product not found' };
     return prod;
 };
killedBy: teste de describe de /products teste da res da rota /products/:id
statusReason: Attempted to wrap prodListById which is already wrapped

[Killed] ConditionalExpression
src/services/prodService.js:14:9
 // Procura produto por Id e se não encontrar dá product not found
 const prodListById = async (id) => {
     const prod = await prodModel.prodListById(id);
-    if (!prod) return { message: 'Product not found' };
+    if (true) return { message: 'Product not found' };
     return prod;
 };
killedBy: teste de describe de /products teste da res da rota /products/:id
statusReason: Attempted to wrap prodListById which is already wrapped

[Killed] BlockStatement
src/services/prodService.js:18:33
     return prod;
 };
 
-const addProd = async (name) => {
-    const prod = await prodModel.addProd(name);
-    return prod;
-};
+const addProd = async (name) => {};
 
 const editProd = async (id, name) => {
killedBy: teste de describe de /products teste da res de post /products
statusReason: expected undefined to deeply equal { id: 9, name: 'T-shirt' }

[Killed] BlockStatement
src/services/prodService.js:23:38
     return prod;
 };
 
-const editProd = async (id, name) => {
-    const prod = await prodModel.editProd(id, name);
-    return prod;
-};
+const editProd = async (id, name) => {};
 
 module.exports = {
killedBy: teste de describe de /products teste a res de put /products/:id
statusReason: expected undefined to deeply equal { id: '1', name: 'Martelo do Batman' }
