[Killed] BlockStatement
src/services/saleService.js:5:30
 
 const saleModel = require('../models/saleModel');
 
-const saleList = async () => {
-    const sale = await saleModel.saleList();
-    return sale;
-};
+const saleList = async () => {};
 
 const saleListById = async (id) => {
killedBy: teste de Service da rota /sales teste da res de /sales
statusReason: expected undefined to deeply equal [ Array(2) ]

[Killed] BlockStatement
src/services/saleService.js:10:36
     return sale;
 };
 
-const saleListById = async (id) => {
-    const sale = await saleModel.saleListById(id);
-    if (!sale || sale.length === 0) {
-        return { message: 'Sale not found' };
-    }
-    return sale;
-};
+const saleListById = async (id) => {};
 
 const addSale = async (sale) => {
killedBy: teste de Service da rota /sales teste da res de /sales/:id
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] BooleanLiteral
src/services/saleService.js:12:9
 
 const saleListById = async (id) => {
     const sale = await saleModel.saleListById(id);
-    if (!sale || sale.length === 0) {
+    if (sale || sale.length === 0) {
         return { message: 'Sale not found' };
     }
killedBy: teste de Service da rota /sales teste da res de /sales/:id
statusReason: Attempted to wrap saleListById which is already wrapped

[Killed] ConditionalExpression
src/services/saleService.js:12:18
 
 const saleListById = async (id) => {
     const sale = await saleModel.saleListById(id);
-    if (!sale || sale.length === 0) {
+    if (!sale || false) {
         return { message: 'Sale not found' };
     }
killedBy: teste de Service da rota /sales teste da res de /sales/:id
statusReason: Attempted to wrap saleListById which is already wrapped

[Killed] BlockStatement
src/services/saleService.js:18:33
     return sale;
 };
 
-const addSale = async (sale) => {
-    const newSale = await saleModel.addSale(sale);
-    return newSale;
-};
+const addSale = async (sale) => {};
 
 module.exports = {
killedBy: teste de Service da rota /sales teste da res de /sales na post function
statusReason: expected undefined to deeply equal { Object (id, itemsSold) }
